---
kind: property
id: P:Autodesk.Revit.DB.Architecture.PostPattern.CornerPost
source: html/e17620b0-0801-31a1-9ec1-5c4fdc417e9e.htm
---
# Autodesk.Revit.DB.Architecture.PostPattern.CornerPost Property

Accesses the object containing properties related to the corner post.

## Syntax (C#)
```csharp
public BalusterInfo CornerPost { get; }
```